import random
import math

# ------------------------- TASK 1 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                   12 месяцев  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")
print("Решения уравнения 28n + 30k + 31m = 365:")
print("""""""""""""""""""""""")

solutions = []
# n не может быть больше 365//28 = 13

for n in range(1, 14):
   for k in range(1, 13):          # 30*12=360, 31*1=31 -> 391 >365, но k=12 ещё возможно
       for m in range(1, 12):      # 31*11=341, остаток 24, но проверим все
           if 28*n + 30*k + 31*m == 365:
               solutions.append((n, k, m))

# Выводим все решения (первое будет с наименьшим n)

for sol in solutions:
   print(f"n={sol[0]}, k={sol[1]}, m={sol[2]}")

print()


# ------------------------- TASK 2 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                Старинная задача бык  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")
print("Решения уравнения 28n + 30k + 31m = 365:")
print("""""""""""""""""""""""")

# Бык – 10 руб, корова – 5 руб, телёнок – 0.5 руб. Всего 100 руб.
# Найти все целые неотрицательные решения (быки, коровы, телята).
# Умножим всё на 2, чтобы избежать дробей: бык=20, корова=10, телёнок=1, сумма=200.

print("Быки,    Коровы,  Телята (всего 100 руб.):")
print("-----------------------------------------")

for b in range(0, 11):      # быков не более 10
   for c in range(0, 21):   # коров не более 20
       for t in range(0, 201):  # телят не более 200
           if 20*b + 10*c + t == 200:
               print(f"быков={b}, коров={c}, телят={t}")

print()


# ------------------------- TASK 3 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("          Гипотеза Эйлера о сумме степеней  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")
print("Поиск пяти чисел, сумма 5-х степеней которых равна 5-й степени другого числа ...")
print("""""""""""""""""""""""")
# надо найти a, b, c, d, e (натуральные, <=150) такие, что a^5 + b^5 + c^5 + d^5 = e^5


MAX_VAL = 150
# предварительно вычисляем 5-е степени и создаём словарь {степень: число}
powers = {}
for i in range(1, MAX_VAL + 1):
   powers[i**5] = i

found = False
# далее код перебирает a <= b <= c <= d для уменьшения числа комбинаций
for a in range(1, MAX_VAL + 1):
   a5 = a**5
   for b in range(a, MAX_VAL + 1):
       b5 = b**5
       sum_ab = a5 + b5
       if sum_ab > MAX_VAL**5:
           break
       for c in range(b, MAX_VAL + 1):
           c5 = c**5
           sum_abc = sum_ab + c5
           if sum_abc > MAX_VAL**5:
               break
           for d in range(c, MAX_VAL + 1):
               d5 = d**5
               total = sum_abc + d5
               if total > MAX_VAL**5:
                   break
               if total in powers:
                   e = powers[total]
                   if e > d:   # обычно e больше d
                       print(f"Найдено: {a}^{5} + {b}^{5} + {c}^{5} + {d}^{5} = {e}^{5}")
                       print(f"a={a}, b={b}, c={c}, d={d}, e={e}")
                       print(f"Сумма a+b+c+d+e = {a+b+c+d+e}")
                       found = True
                       break
           if found:
               break
       if found:
           break
   if found:
       break
if not found:
   print("В заданном диапазоне решений не найдено.")
print()


# ------------------------- TASK 4 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                     Все вместе  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")

# анализ цифр натурального числа

num = int(input("Введите натуральное число: "))
print("------------------------------------------")


original = num

count_3 = 0
last_digit = num % 10
count_last = 0
count_even = 0
sum_greater5 = 0
product_greater7 = 1
has_greater7 = False
count_0_and_5 = 0

while num > 0:
   digit = num % 10

   # количество цифр 3
   if digit == 3:
       count_3 += 1

   # сколько раз встречается последняя цифра
   if digit == last_digit:
       count_last += 1

   # количество чётных цифр
   if digit % 2 == 0:
       count_even += 1

   # сумма цифр, больших пяти
   if digit > 5:
       sum_greater5 += digit

   # произведение цифр, больших семи
   if digit > 7:
       product_greater7 *= digit
       has_greater7 = True

   # сколько раз встречаются 0 или 5
   if digit == 0 or digit == 5:
       count_0_and_5 += 1
   num //= 10

if not has_greater7:
   product_greater7 = 1

print("Количество цифр 3:", count_3)
print("Сколько раз встречается последняя цифра:", count_last)
print("Количество чётных цифр:", count_even)
print("Сумма цифр, больших пяти:", sum_greater5)
print("Произведение цифр, больших семи:", product_greater7)
print("Суммарное количество цифр 0 и 5:", count_0_and_5)
print()


# ------------------------- TASK 5 -------------------------
# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("              Магический шар восьмёрка  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")

# Список из 20 ответов
answers = [
    "Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да",
    "Можешь быть уверен в этом", "Мне кажется - да", "Вероятнее всего",
    "Хорошие перспективы", "Знаки говорят - да", "Да",
    "Пока не ясно, попробуй снова", "Спроси позже", "Лучше не рассказывать",
    "Сейчас нельзя предсказать", "Сконцентрируйся и спроси опять",
    "Даже не думай", "Мой ответ - нет", "По моим данным - нет",
    "Перспективы не очень хорошие", "Весьма сомнительно"
]

print("Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.")
print("Как тебя зовут? ")
name = input("Напиши пожалуйста: ")

print(f"Привет, {name}!")

while True:
    question = input("Задай свой вопрос (или нажми Enter для выхода): ")
    if question == "":
        break
    answer = random.choice(answers)
    print("Магический шар говорит:", answer)
    again = input("Хочешь задать ещё вопрос? (да/нет): ").strip().lower()
    if again != "да" and again != "yes" and again != "д":
        print("Возвращайся, если возникнут вопросы!")
        break












































