import random

# ------------------------- TASK 1 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("               Список нечётных чисел  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")

n = int(input("Введите число n (n ≥ 1): "))

# берём числа от 1 до n, оставляем только нечётные
odd_numbers = [num for num in range(1, n + 1) if num % 2 != 0]
print(f"Список нечётных чисел от 1 до {n}: {odd_numbers}")


# ------------------------- TASK 2 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                     Анализ цен  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")
print("""""""""""""""""""""""")

prices = [1500, 500, 2000, 3500, 1000, 4500]

print('Цены:', *prices)
print("""""""""""""""""""""""")

print(f'Самый дорогой товар: {max(prices)}')
print(f'Самый дешевый товар: {min(prices)}')
print(f'Общую стоимость всех товаров: {sum(prices)}')
print(f'Средняя цена товара: {sum(prices) // len(prices)}')


# ------------------------- TASK 3 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                 Изменение списка  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")

users = ['Admin', 'Guest', 'User', 'Bot']
print("Исходный список:", users)

users[2] = 'Moderator'
print("После замены 'User' -> 'Moderator':", users)

users[-1] = 'SuperAdmin'
print("После замены 'Bot' -> 'SuperAdmin':", users)

users.append('Newbie')
print("Итоговый список:", users)


# ------------------------- TASK 4 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                  Ручной подсчет  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")

marks = [5, 4, 3, 5, 2, 5, 4, 3, 5, 5]
count_fives = 0
count_twos = 0
for mark in marks:
    if mark == 5:
        count_fives += 1
    elif mark == 2:
        count_twos += 1

print(f"Список оценок: {marks}")
print(f"Количество пятёрок: {count_fives}")
print(f"Количество двоек: {count_twos}")


# ------------------------- TASK 5 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                   Магия срезов  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")

data = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
print("Исходный список:", data)

first_three = data[:3]
print("Первая тройка:", first_three)

last_three = data[-3:]
print("Последняя тройка:", last_three)

reversed_list = data[::-1]
print("В обратном порядке:", reversed_list)

odd_index_elements = data[1::2]
print("Элементы с нечётными индексами:", odd_index_elements)


# ------------------------- TASK 6 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                      Палиндром  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")

word = input("Введите слово: ")
chars = list(word)
reversed_chars = chars[::-1]

if chars == reversed_chars:
   print(f"'{word}' -> это палиндром")
else:
   print(f"'{word}' -> не палиндром")


# ------------------------- TASK 7 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                Ручной поиск индекса  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")

numbers = [10, 20, 30, 40, 50]
print("Список:", numbers)
target = int(input("Введите число для поиска: "))
found_index = None

for i in range(len(numbers)):
   if numbers[i] == target:
       found_index = i
       break   # остановка цикла после первого найденного
if found_index is not None:
   print(f"Число {target} найдено на индексе {found_index}")
else:
   print("Нет такого числа")


# ------------------------- TASK 8 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                  Обмен значений  ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")

A = [random.randint(1, 100) for i in range(5)]
print('Список чисел: ', *A)

min_A = A.index(min(A))

A[0], A[min_A] = A[min_A], A[0]

print('Измененная версия списка: ', *A)