# ------------------------- TASK 1 -------------------------

import math
# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                Таблица умножения на n ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")




numb = int(input("Введите любое натуральное число: "))
for i in range(1,11):
  print("ответ:", numb * i)



# ------------------------- TASK 2 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                 Only even numbers ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")



# Флаг для проверки всех чисел
flag = True


# Проверяем 10 чисел
for i in range(10):
  numb = int(input("Введите число: "))
  if numb % 2 != 0:  # если число нечётное
      flag = False


# Выводим результат
if flag:
  print("YES")
else:
  print("NO")



# ------------------------- TASK 3 -------------------------


import math
# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("               Знакочередующаяся сумма ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")



n = int(input("Введите число: "))
total = 0
sign = 1


for i in range(1, n + 1):
 total += sign * i
 sign *= -1


print(total)



# ------------------------- TASK 4 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                     Популяция ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")



m = int(input("Начальное количество: "))
p = float(input("Процент роста: "))
n = int(input("Количество дней: "))


for day in range(1, n + 1):
  m = m * (1 + p / 100)
  print(f"день {day} {m:.2f}")



# ------------------------- TASK 5 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                   Наибольшие числа ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")


n = int(input("Количество чисел: "))
max1 = 0
max2 = 0


for i in range(n):
 num = int(input("Введите число: "))
 if num > max1:
     max2 = max1
     max1 = num
 elif num > max2:
     max2 = num



print(f"Максимальное число: ",max1)
print(f"Второе по величине число: ",max2)




# ------------------------- TASK 6 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("              Угадай число за 3 попытки ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")


# Задаем конкретное число, которое нужно угадать
SECRET_NUM = 7  # Можно выбрать любое число от 1 до 10


# Количество попыток
ATTEMPS = 3


# Цикл для трех попыток
for attempt in range(1, ATTEMPS + 1):
  # Просим пользователя ввести число
  guess = int(input(f"Попытка {attempt}. Введите число от 1 до 10: "))


  # Проверяем, угадал ли пользователь
  if guess == SECRET_NUM:
      print("""""""""""""""""""""""")
      print("Угадали!")
      break  # Выходим из цикла, если угадали
  else:
      print("""""""""""""""""""""""")
      print("Неверно")


      # Подсказываем пользователю
      if guess < SECRET_NUM:
          print("Загаданное число больше")
          print("""""""""""""""""""""""")
      else:
          print("Загаданное число меньше")
          print("""""""""""""""""""""""")


# Если все попытки исчерпаны
else:
  print(f"Вы не угадали. Загаданное число было {SECRET_NUM}")


