# ------------------------- TASK 1 -------------------------

# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                 Определение сезона ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")


# Программа "Определение сезона"
month = int(input("Введите номер месяца (1–12): "))


match month:
   case 12 | 1 | 2:
       season = "зима"
       emoji = "❄️"
   case 3 | 4 | 5:
       season = "весна"
       emoji = "🌷"
   case 6 | 7 | 8:
       season = "лето"
       emoji = "☀️"
   case 9 | 10 | 11:
       season = "осень"
       emoji = "🍂"
   case _:
       # Обработка некорректного ввода (хотя по условию от 1 до 12)
       print("Ошибка: введите число от 1 до 12.")
       exit()


# Вывод результата с использованием f-строки
print(f"Месяц {month}: {season} {emoji}")


# ------------------------- TASK 2 -------------------------


# Design программы
print("""""""""""""""""""""""")
print("     )----------------------------------------(")
print("                 Простой калькулятор ")
print("     )----------------------------------------(")
print("""""""""""""""""""""""")




# Ввод данных
num1 = float(input("Введите первое число: "))
operation = input("Введите операцию (+, -, *, /): ")
num2 = float(input("Введите второе число: "))


# Выполнение операции с помощью match-case
match operation:
   case "+":
       result = num1 + num2
       print("""""""""""""""""""""""")
       print(f"{num1} + {num2} = {result}")


   case "-":
       result = num1 - num2
       print("""""""""""""""""""""""")
       print(f"{num1} - {num2} = {result}")


   case "*":
       result = num1 * num2
       print("""""""""""""""""""""""")
       print(f"{num1} * {num2} = {result}")


   case "/":
       if num2 == 0:
           print("""""""""""""""""""""""")
           print("!!! Ошибка: деление на ноль")
       else:
           result = num1 / num2
           print("""""""""""""""""""""""")
           print(f"{num1} / {num2} = {result}")


   case _:


       print("""""""""""""""""""""""")
       print("!!! Обнаружена Неизвестная операция")



# ------------------------- TASK 3 -------------------------








